Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator class defines a manipulator to show and modify the distance between two points.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator.dimensionManipulator
The internal manipulator.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator.#ctor(System.Object,Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext,Tekla.Structures.Geometry3d.LineSegment)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator class.
parent: The parent object.
manipulationContext: The manipulation context.
segment: The segment defining the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator.MeasureChanged
Event to be called when the current measure has been changed.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator.MeasureChangeOngoing
Event to be called when the measure change is ongoing.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator.Segment
Gets or sets the dimensioned Tekla.Structures.Geometry3d.LineSegment.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator.Parent
Gets or sets the parent object.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator.AttachToManipulatorService(Tekla.BIM.DirectManipulation.Services.Manipulators.IManipulatorService)


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator.Dispose(System.Boolean)


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator.OnMeasureChanged(Tekla.BIM.DirectManipulation.Services.Manipulators.DimensionManipulatorBase)
Event handler for the Tekla.BIM.DirectManipulation.Services.Manipulators.DimensionManipulatorBase.MeasureChanged event.
manipulator: The manipulator.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator.OnMeasureChangeOngoing(Tekla.BIM.DirectManipulation.Services.Manipulators.DimensionManipulatorBase)
Event handler for the Tekla.BIM.DirectManipulation.Services.Manipulators.DimensionManipulatorBase.MeasureChangeOngoing event.
manipulator: The manipulator.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.DistanceManipulator.InitializeInternalManipulator(System.Object,Tekla.Common.Geometry.Segment3)
Initializes the internal manipulator.
parent: The parent.
segment: The segment.